#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_kms_key.mykey: Refreshing state... [id=24860abd-510d-4066-ad71-2d8afb85d5eb]
aws_s3_bucket.TestBucket: Refreshing state... [id=ex3-guide-my-tf-test-bucket-uyhgyhgjhghuygugjhfgjhf2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_kms_key.mykey has changed
  ~ resource "aws_kms_key" "mykey" {
        id                                 = "24860abd-510d-4066-ad71-2d8afb85d5eb"
      + tags                               = {}
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.TestBucket2 will be created
  + resource "aws_s3_bucket" "TestBucket2" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "ex3-guide-second-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "ex3-guide"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "ex3-guide"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @FaizanRaza-InterWeave, Action: `pull_request`*